Информатика:

- [x] 1
- [x] 2
- [x] 3
- [x] 4
- [x] 5
- [ ] 6
- [x] 7
- [ ] 8
- [ ] 9
- [ ] 10
- [x] 11
- [x] 14

---

## Алгоритмы:

##### Задача 1

- Нахождение уникальных вершин
- Нахождение соседних вершин для уникальных вершин
- Нахождение длин рёбер по условию задачи

---

##### Задача 2
Дано:
((_x_ → _y_) ≡ (_y_ → _z_)) ∧ (_y_ ∨ _w_)

[Таблица истинности](attachments/20250412191005.png)

Вопрос:
Вывести последовательность букв соответствующих таблице истинности

Решение:
```python
print("x y z w")
for x in range(2):
	for y in range(2):
		for z in range(2):
			for w in range(2):
				f = ((x <= y) == (y <= z)) and (y or w)
				if f == 1:
					print(x, y, z, w)
```
1. Ищем уникальные строки из таблицы из "дано", сопоставляем их с таблицей после выполнения кода
2. Делаем первый пункт до тех пор, пока пустые ячейки таблицы истинности из "дано" не заполнятся
- переменная 1 = x
- переменная 2 = z
- переменная 3 = w
- переменная 4 = y

Ответ: **xzwy**

---

##### Задача 5

- Есть всегда исходное число
- Есть алгоритм преобразования числа
- Есть выходное число (результирующее)
  Надо сделать:
- Решить на бумаге
- Перебрать возможные исходные числа
- Сравнивать исходное после алгоритма с выходным числом

---

##### Задача 7 (хранение и передача информации)

Дано:
- Время передачи 30 секунд
- Повторная оцифровка:
  - Разрешение >2х
  - Дискритезация <1.5x
- Скорость передачи файла в город Б больше в 4х чем в город А

Вопрос:
- Сколько секунд передавался файл в город Б?

Решение:
- время передачи _ дельта разрешения = 30 _ 2x = 60 сек
- полученный результат / дельта дискретизации = 60 сек / 1.5x = 40 сек
- полученный результат / дельта скорости = 40 сек / 4x = <u>10 сек</u>

Ответ: 10

---

##### Задача 11 (пароли)

Дано:
- Пароль из 15 символов
- Алфавит из 12 букв
- Для каждого пользователя <u>минимальное</u> и <u>одинаковое</u> количество памяти (байты)
- Для каждого пароля <u>минимальное</u> и <u>одинаковое</u> количество памяти (биты)
- Кроме пароля на каждого пользователя 12 байт (доп инфа)

Вопрос:
- Определить объём памяти (в байтах), необходимый для хранения сведений о 50 пользователях

Решение:
- алфавит из 12 букв = 4 бита (4 разряда)
- пароль из 15 символов = 15 \* 4 бита = 60 бит
- пароль для 1 пользователя = 60 бит = 60 / 8 = округлили в > сторону = 8 байт
- 1 пользователь = 12 байт + 8 байт = 20 байт
- объём памяти для 50 пользователей = 20 байт \* 50 = 1000 байт

Ответ: 1000

---

##### Задача 14 (системы счислений)

Дано:
- Числа в разных СС
- Операция производимая над числами
- Неизвестные цифры у чисел (х, у)
- Число, которое проверяет кратность

Вопрос:
- Какое число подходит под все условия задачи?

Пример:
- Задача:
Операнды арифметического выражения записаны в системах счисления с основаниями 9 и 11:
88x4y9 + 7x44y11.
В записи чисел переменными x и y обозначены допустимые в данных системах счисления неизвестные цифры. Определите значения x и y, при которых значение данного арифметического выражения будет наименьшим и кратно 61. Для найденных значений x и y вычислите частное от деления значения арифметического выражения на 61 и укажите его в ответе в десятичной системе счисления. Основание системы счисления в ответе указывать не нужно.
- Решение:
```python
result_search = []
for x in '012345678':
    for y in '012345678':
        t = int('88' + x + '4' + y, 9) + int('7' + x + '44' + y, 11)
        if t % 61 == 0:
            result_search.append(t)

if result_search:         
    print(min(result_search) // 61)
```